# ServerInternalException Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ServerInternalException Class
Members See Also
---
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class ServerInternalException : ApplicationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class ServerInternalException _
	Inherits ApplicationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class ServerInternalException : public ApplicationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..ServerInternalException
# See Also
ServerInternalException Members
Autodesk.Revit.Exceptions Namespace